---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings
source: html/5c220e9d-68cb-0aae-a637-57e6927525a8.htm
---
# CircuitNamingSchemeSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.